doc/documentation_and_writeup.org
#+TITLE: CS449 Sprint 1 Report
#+AUTHOR: Michael Cu, Elias Julian Marko Garcia, Samual Lim
#+SUBTITLE: Team \textbf{Misael's} Project Submission
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{array}

* Micro Charter
  :PROPERTIES:
  :CUSTOM_ID: S1
  :END:   
** Project Name
   :PROPERTIES:
   :END:
   N Men Morris
** Vision Statement
   :PROPERTIES:
   :END:
   Create a extensible framework for board game web apps with scalability and performance.
** Mission Statement
   :PROPERTIES:
   :END:
   To play Nine Men's Morris on the web browser using a composable web technology stack that allows
   for future modularity while not foregoing performance.
** Elevator Pitch and Business Value
   :PROPERTIES:
   :END:
   We are creating Nine Men's Morris on a board game framework using Express.js and Neon for
   Rust. This allows for a data and type safe application that is capable of composability,
   scalability, extensibility, and performance.
** Customers and Users
   :PROPERTIES:
   :END:
   - Customers: Entrepreneurs and ventures that want to deploy board games on the web with low
     overhead, latency, and maintenance.
   - Users: Individuals who are passionate about board games and want a new online experience that
     they can take and play wherever they go with their friends.
** Metrics
   :PROPERTIES:
   :END:
   By benchmarking N Men Morris, we can compare our solution to other products on the market on:
   1. latency
   2. binary size
   3. up-time
** Milestones
   :PROPERTIES:
   :END:
   1. First MVP
   2. First Offline N Men's Morris
   3. Player versus Player (Offline)
   4. Player versus Player (Online)
** Risks
   :PROPERTIES:
   :END:
   1. Inherent complexity of technology stack.
   2. Inability to cooperate with teammates.
   3. Plausibility of orphaning project due to development team size.
** Authors
   :PROPERTIES:
   :END:
   - Michael Cu
   - Elias Julian Marko Garcia
   - Samual Lim
* User Stories
  :PROPERTIES:
  :CUSTOM_ID: S2
  :END:

  Below you will find a table that makes up our "User Story Board", with some simplifications taken
  with respect to the total contents of the board. With respect to the final formal documentation,
  i.e. this paper, we only keep the basic qualitative and quantitative values for each story in the
  table while giving each user story proper its own section. This makes documenting each story
  less unruly while also easier to read. Each Story I.D. (SID) value is internally linked to its
  respective story, which also helps with navigating this section.
  
   #+ATTR_LaTeX: :align |c|m{3.5cm}|c|c|c|c|m{2.0cm}|
   |     |                           |          | Time Est. | Actual |        |                     |
   | SID | Story Name                | Priority |      (hr) | (hr)   | Status | Developer(s)        |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID1][S1]]  | Mills Board               | high     |        10 | 4      | DONE   | Sam, Michael, Elias |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID2][S2]]  | User Input and            | high     |        10 | 4      | DONE   | Sam                 |
   |     | Selection                 |          |           |        |        |                     |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID3][S3]]  | Starting a Game           | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID4][S4]]  | Assigning Players         | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID5][S5]]  | Piece Placement           | high     |        10 | 2      | TODO   | Sam, Michael        |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID6][S6]]  | Piece Movement            | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID7][S7]]  | Mill Formation            | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID8][S8]]  | Piece Elimination         | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID9][S9]]  | Flying Pieces             | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID10][S10]] | Defining End Game         | medium   |        10 | -      | TODO   | -                   |
   |-----+---------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID11][S11]] | Restarting/Replaying Game | medium   |        10 | -      | TODO   | -                   |


** Mills Board
   :PROPERTIES:
   :CUSTOM_ID: SID1
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need an empty board consisting of 4 expanded squares with 8 equidistant positions
    each to play a game of Nine Men's Morris.
** User Input and Selection
   :PROPERTIES:
   :CUSTOM_ID: SID2
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to be able to select and choose input from the web GUI of the application to
    be able to play and take turns at Nine Men's Morris.
** Starting a Game
   :PROPERTIES:
   :CUSTOM_ID: SID3
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need a GUI to prompt me with the options to start a game with either another human
    or against the computer for Nine Men's Morris in order to play the game.
** Assigning Players
   :PROPERTIES:
   :CUSTOM_ID: SID4
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to be assigned the role as either the first or second player, whether against
    another human or the computer, in order to know my player turn (either first or second) in the
    game.
** Piece Placement
   :PROPERTIES:
   :CUSTOM_ID: SID5
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to place nine pieces on unoccupied positions in turn with another player to
    start off a game of Nine Men's Morris.
** Piece Movement
   :PROPERTIES:
   :CUSTOM_ID: SID6
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to be able to move my pieces into adjacent positions that are not occupied by
    the other player or adjacent to their mill in order to take a turn.
** Mill Formation
   :PROPERTIES:
   :CUSTOM_ID: SID7
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need the game to recognize that I have formed a mill upon moving three of my own
    pieces into adjacent positions so that I may gain the future ability to attack and defend my
    mill pieces from being eliminated.
** Piece Elimination
   :PROPERTIES:
   :CUSTOM_ID: SID8
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, after forming a mill, I need the ability to remove an opponent's piece of my choosing
    so long as either it is not in a mill or any piece given all available pieces are in a mill, so
    that I may appropriately attack my opponent.
** Flying Pieces
   :PROPERTIES:
   :CUSTOM_ID: SID9
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, upon reaching three remaining pieces, I need the ability to fly (jump) my pieces
    across the board to any un-occupied point in order to play Nine Men's Morris according to the
    rules. Whether the position is guarded is a variant of the game, implementation decision TBD.
** Defining End Game
   :PROPERTIES:
   :CUSTOM_ID: SID10
   :END:
