doc/documentation_and_writeup.tex
% Created 2019-10-06 Sun 23:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{float}
\usepackage{array}
\author{Michael Cu, Elias Julian Marko Garcia, Samual Lim}
\date{\today}
\title{CS449 Sprint 1 Report\\\medskip
\large Team \textbf{Misael's} Project Submission}
\hypersetup{
 pdfauthor={Michael Cu, Elias Julian Marko Garcia, Samual Lim},
 pdftitle={CS449 Sprint 1 Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Micro Charter}
\label{sec:orgfa087ef}
\subsection{Project Name}
\label{sec:org04464a4}
N Men Morris
\subsection{Vision Statement}
\label{sec:orgb9adaba}
Create a extensible framework for board game web apps with scalability and performance.
\subsection{Mission Statement}
\label{sec:orgf769ce1}
To play Nine Men's Morris on the web browser using a composable web technology stack that allows
for future modularity while not foregoing performance.
\subsection{Elevator Pitch and Business Value}
\label{sec:orga879cdd}
We are creating Nine Men's Morris on a board game framework using Express.js and Neon for
Rust. This allows for a data and type safe application that is capable of composability,
scalability, extensibility, and performance.
\subsection{Customers and Users}
\label{sec:org6ddc1ae}
\begin{itemize}
\item Customers: Entrepreneurs and ventures that want to deploy board games on the web with low
overhead, latency, and maintenance.
\item Users: Individuals who are passionate about board games and want a new online experience that
they can take and play wherever they go with their friends.
\end{itemize}
\subsection{Metrics}
\label{sec:orgc0f95ed}
By benchmarking N Men Morris, we can compare our solution to other products on the market on:
\begin{enumerate}
\item latency
\item binary size
\item up-time
\end{enumerate}
\subsection{Milestones}
\label{sec:org79e21bf}
\begin{enumerate}
\item First MVP
\item First Offline N Men's Morris
\item Player versus Player (Offline)
\item Player versus Player (Online)
\end{enumerate}
\subsection{Risks}
\label{sec:org4c6ebe9}
\begin{enumerate}
\item Inherent complexity of technology stack.
\item Inability to cooperate with teammates.
\item Plausibility of orphaning project due to development team size.
\end{enumerate}
\subsection{Authors}
\label{sec:org004e638}
\begin{itemize}
\item Michael Cu
\item Elias Julian Marko Garcia
\item Samual Lim
\end{itemize}
\section{User Stories}
\label{sec:orgd6a22cc}
Below you will find a table that makes up our "User Story Board", with some simplifications taken
with respect to the total contents of the board. With respect to the final formal documentation,
i.e. this paper, we only keep the basic qualitative and quantitative values for each story in the
table while giving each user story proper its own section. This makes documenting each story
less unruly while also easier to read. Each Story I.D. (SID) value is internally linked to its
respective story, which also helps with navigating this section.

\begin{center}
\begin{tabular}{|c|m{3.5cm}|c|c|c|c|m{2.0cm}|}
 &  &  & Time Est. & Actual &  & \\
SID & Story Name & Priority & (hr) & (hr) & Status & Developer(s)\\
\hline
\hyperref[sec:org9d3ac7c]{S1} & Mills Board & high & 10 & 4 & DONE & Sam, Michael, Elias\\
\hline
\hyperref[sec:orgc754eda]{S2} & User Input and & high & 10 & 4 & DONE & Sam\\
 & Selection &  &  &  &  & \\
\hline
\hyperref[sec:org17bd791]{S3} & Starting a Game & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org1c88768]{S4} & Assigning Players & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orga52ce5b]{S5} & Piece Placement & high & 10 & 2 & TODO & Sam, Michael\\
\hline
\hyperref[sec:org3a86a65]{S6} & Piece Movement & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgc00f428]{S7} & Mill Formation & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgc9e6408]{S8} & Piece Elimination & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgb645688]{S9} & Flying Pieces & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orga824286]{S10} & Defining End Game & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org2603bac]{S11} & Restarting/Replaying Game & medium & 10 & - & TODO & -\\
\end{tabular}
\end{center}


\subsection{Mills Board}
\label{sec:org9d3ac7c}
\subsubsection*{Description}
\label{sec:orge72afa4}
As a user, I need an empty board consisting of 4 expanded squares with 8 equidistant positions
each to play a game of Nine Men's Morris.
\subsection{User Input and Selection}
\label{sec:orgc754eda}
\subsubsection*{Description}
\label{sec:org9c6df85}
As a user, I need to be able to select and choose input from the web GUI of the application to
be able to play and take turns at Nine Men's Morris.
\subsection{Starting a Game}
\label{sec:org17bd791}
\subsubsection*{Description}
\label{sec:org63b9664}
As a user, I need a GUI to prompt me with the options to start a game with either another human
or against the computer for Nine Men's Morris in order to play the game.
\subsection{Assigning Players}
\label{sec:org1c88768}
\subsubsection*{Description}
\label{sec:orgf6edfa2}
As a user, I need to be assigned the role as either the first or second player, whether against
another human or the computer, in order to know my player turn (either first or second) in the
game.
\subsection{Piece Placement}
\label{sec:orga52ce5b}
\subsubsection*{Description}
\label{sec:org76ebf5d}
As a user, I need to place nine pieces on unoccupied positions in turn with another player to
start off a game of Nine Men's Morris.
\subsection{Piece Movement}
\label{sec:org3a86a65}
\subsubsection*{Description}
\label{sec:orgc4e1048}
As a user, I need to be able to move my pieces into adjacent positions that are not occupied by
the other player or adjacent to their mill in order to take a turn.
\subsection{Mill Formation}
\label{sec:orgc00f428}
\subsubsection*{Description}
\label{sec:org3cb80cd}
As a user, I need the game to recognize that I have formed a mill upon moving three of my own
pieces into adjacent positions so that I may gain the future ability to attack and defend my
mill pieces from being eliminated.
\subsection{Piece Elimination}
\label{sec:orgc9e6408}
\subsubsection*{Description}
\label{sec:org3140cc7}
As a user, after forming a mill, I need the ability to remove an opponent's piece of my choosing
so long as either it is not in a mill or any piece given all available pieces are in a mill, so
that I may appropriately attack my opponent.
\subsection{Flying Pieces}
\label{sec:orgb645688}
\subsubsection*{Description}
\label{sec:org18c2b7c}
As a user, upon reaching three remaining pieces, I need the ability to fly (jump) my pieces
across the board to any un-occupied point in order to play Nine Men's Morris according to the
rules. Whether the position is guarded is a variant of the game, implementation decision TBD.
