doc/documentation_and_writeup.org
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, when either myself or the opponent reaches less than three pieces, i.e. two pieces, I
    need the game and to declare the respective winner in order to successfully finish a game of
    Nine Men's Morris.
** Restarting and Replaying a Game
   :PROPERTIES:
   :CUSTOM_ID: SID11
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, after having completed a game of Nine Men's Morris, I need the GUI to prompt me to
    either play again or to end the game software so that I can accordingly choose whether to keep
    playing or to end my game session.
** [Template User Story]
   :PROPERTIES:
   :UNNUMBERED: t
   :END:
*** Description
*** Priority
*** Estimate
*** Actual
*** Status
*** Developer
* Acceptance Criteria
  :PROPERTIES:
  :CUSTOM_ID: S3
  :END:

  The following section covers the acceptance criteria enumerated in response to the User Stories
  discovered and documented in [[#S2][$\S{2}$]]. In a similar fashion to $\S{2}$, the table documenting these
  acceptance criteria is in a simplified form. Every Acceptance Criterion has an Acceptance
  Criterion ID (=ACID=), which is associated in the table below with its respective =SID=, development
  status, and the developers responsible for implementing it. Each =ACID= is linked to its respective
  subsection below for viewing the description of each criterion.

   #+ATTR_LaTeX: :align |l|c|c|c|
   | SID & Name                   | ACID | Status | Developer(s)        |
   |------------------------------+------+--------+---------------------|
   | [[#SID1][S1]] Mills Board               | [[#ACID1][A1]]   | DONE   | Sam, Elias, Michael |
   |------------------------------+------+--------+---------------------|
   | [[#SID2][S2]] User Input and Selection  | [[#ACID2][A2]]   | DONE   | Sam, Elias, Michael |
   |------------------------------+------+--------+---------------------|
   | [[#SID3][S3]] Starting a Game           | [[#ACID3][A3]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID4][S4]] Assigning Players         | [[#ACID4][A4]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID5][S5]] Piece Placement           | [[#ACID5][A5]]   | DONE   | Sam, Michael        |
   |------------------------------+------+--------+---------------------|
   | [[#SID6][S6]] Piece Movement            | [[#ACID6][A6]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID7][S7]] Mill Formation            | [[#ACID7][A7]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID8][S8]] Piece Elimination         | [[#ACID8][A8]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID9][S9]] Flying Pieces             | [[#ACID9][A9]]   | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID10][S10]] Defining End Game        | [[#ACID10][A10]]  | TODO   | -                   |
   |------------------------------+------+--------+---------------------|
   | [[#SID11][S11]] Restarting/Replaying     | [[#ACID11][A11]]  | TODO   | -                   |
   | $\hspace{0.4cm}$ Game        |      |        |                     |

** Criterion 1
   :PROPERTIES:
   :CUSTOM_ID: ACID1
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   | ACID | Description                                                                |
   |------+----------------------------------------------------------------------------|
   |  1.0 | Given a User...                                                            |
   |------+----------------------------------------------------------------------------|
   |  1.1 | When the User visits our site (IP), then an interactive board will appear. |
   |      |                                                                            |
   |  1.2 | When the User does not visit our site (IP), our board will not appear.     |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 2
   :PROPERTIES:
   :CUSTOM_ID: ACID2
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   | ACID | Description                                                            |
   |------+------------------------------------------------------------------------|
   |  2.0 | Given a User using the application...                                  |
   |------+------------------------------------------------------------------------|
   |  2.1 | When a user clicks on an interactive button of the application's page, |
   |      | then the application will detect the user input event.                 |
   |      |                                                                        |
   |  2.2 | When a user clicks on a non-interactive button of the application's    |
   |      | page, then the application will not detect any input.                  |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 3
   :PROPERTIES:
   :CUSTOM_ID: ACID3
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  3.0 | Given a User using the application...                                   |
   |------+-------------------------------------------------------------------------|
   |  3.1 | When a user enters HUMAN as an opponent, then the application will      |
   |      | allow for a second human player.                                        |
   |      |                                                                         |
   |  3.2 | When a user enters AI as an opponent, then the application will assign  |
   |      | an AI as a second player.                                               |
   |      |                                                                         |
   |  3.3 | When a user chooses neither a HUMAN or AI as an opponent then the       |
   |      | application will not choose and will re-prompt the user to choose an    |
   |      | opponent type.                                                          |
   #+TBLFM: 

*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 4
   :PROPERTIES:
   :CUSTOM_ID: ACID4
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  4.0 | Given a User using the application...                                   |
   |------+-------------------------------------------------------------------------|
   |  4.1 | When a user chooses player one, then the application will assign the    |
   |      | role of player one to the user.                                         |
   |      |                                                                         |
   |  4.2 | When a user chooses player 2, then the application will assign the      |
   |      | role of player two to the user.                                         |
   |      |                                                                         |
   |  4.3 | When a user chooses neither player one or player two then the           |
   |      | application will not will not assign a player and the player will       |
   |      | be re-prompted                                                          |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    
    None for now.

** Criterion 5
   :PROPERTIES:
   :CUSTOM_ID: ACID5
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |       | <71>                                                                    |
   |  ACID | Description                                                             |
   |-------+-------------------------------------------------------------------------|
   | 5.1.0 | Given a User playing a game with unassigned pieces...                   |
   |-------+-------------------------------------------------------------------------|
   | 5.1.1 | When the user enters an unoccupied position, then a piece of the users  |
   |       | color will be placed in the position.                                   |
   |       |                                                                         |
   | 5.1.2 | When the user enters an occupied position, a piece of the users color   |
   |       | will not be placed in the position.                                     |
   |-------+-------------------------------------------------------------------------|
   | 5.2.0 | Given a User playing a game with no unassigned pieces...                |
   |-------+-------------------------------------------------------------------------|
   | 5.2.1 | When the user enters an unoccupied position, then a piece of the users  |
   |       | color will not be placed in the position.                               |
   |       |                                                                         |
   | 5.2.2 | When the user enters an occupied position, then a piece of the users    |
   |       | color will not be placed in the position.                               |

   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
   
    None for now.

