doc/documentation_and_writeup.tex
\subsection{Defining End Game}
\label{sec:orga824286}
\subsubsection*{Description}
\label{sec:org8458f70}
As a user, when either myself or the opponent reaches less than three pieces, i.e. two pieces, I
need the game and to declare the respective winner in order to successfully finish a game of
Nine Men's Morris.
\subsection{Restarting and Replaying a Game}
\label{sec:org2603bac}
\subsubsection*{Description}
\label{sec:orgbea44cb}
As a user, after having completed a game of Nine Men's Morris, I need the GUI to prompt me to
either play again or to end the game software so that I can accordingly choose whether to keep
playing or to end my game session.
\subsection*{[Template User Story]}
\label{sec:orgc86ff73}
\subsubsection*{Description}
\label{sec:org72b99a8}
\subsubsection*{Priority}
\label{sec:org376ba87}
\subsubsection*{Estimate}
\label{sec:orge781983}
\subsubsection*{Actual}
\label{sec:org4253512}
\subsubsection*{Status}
\label{sec:orgddfa3a6}
\subsubsection*{Developer}
\label{sec:orgfa6f477}
\section{Acceptance Criteria}
\label{sec:orga7b8721}
The following section covers the acceptance criteria enumerated in response to the User Stories
discovered and documented in \hyperref[sec:orgd6a22cc]{\(\S{2}\)}. In a similar fashion to \(\S{2}\), the table documenting these
acceptance criteria is in a simplified form. Every Acceptance Criterion has an Acceptance
Criterion ID (\texttt{ACID}), which is associated in the table below with its respective \texttt{SID}, development
status, and the developers responsible for implementing it. Each \texttt{ACID} is linked to its respective
subsection below for viewing the description of each criterion.

\begin{center}
\begin{tabular}{|l|c|c|c|}
SID \& Name & ACID & Status & Developer(s)\\
\hline
\hyperref[sec:org9d3ac7c]{S1} Mills Board & \hyperref[sec:org96fae39]{A1} & DONE & Sam, Elias, Michael\\
\hline
\hyperref[sec:orgc754eda]{S2} User Input and Selection & \hyperref[sec:org1818dbf]{A2} & DONE & Sam, Elias, Michael\\
\hline
\hyperref[sec:org17bd791]{S3} Starting a Game & \hyperref[sec:org4920f6c]{A3} & TODO & -\\
\hline
\hyperref[sec:org1c88768]{S4} Assigning Players & \hyperref[sec:org035372e]{A4} & TODO & -\\
\hline
\hyperref[sec:orga52ce5b]{S5} Piece Placement & \hyperref[sec:org7ed082b]{A5} & DONE & Sam, Michael\\
\hline
\hyperref[sec:org3a86a65]{S6} Piece Movement & \hyperref[sec:org95d72ba]{A6} & TODO & -\\
\hline
\hyperref[sec:orgc00f428]{S7} Mill Formation & \hyperref[sec:org6757cb1]{A7} & TODO & -\\
\hline
\hyperref[sec:orgc9e6408]{S8} Piece Elimination & \hyperref[sec:org1d2cae3]{A8} & TODO & -\\
\hline
\hyperref[sec:orgb645688]{S9} Flying Pieces & \hyperref[sec:org0aa663a]{A9} & TODO & -\\
\hline
\hyperref[sec:orga824286]{S10} Defining End Game & \hyperref[sec:org38befea]{A10} & TODO & -\\
\hline
\hyperref[sec:org2603bac]{S11} Restarting/Replaying & \hyperref[sec:orgbbb3dbc]{A11} & TODO & -\\
\(\hspace{0.4cm}\) Game &  &  & \\
\end{tabular}
\end{center}

\subsection{Criterion 1}
\label{sec:org96fae39}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
1.0 & Given a User\ldots{}\\
\hline
1.1 & When the User visits our site (IP), then an interactive board will appear.\\
 & \\
1.2 & When the User does not visit our site (IP), our board will not appear.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:orgfda6e61}
None for now.

\subsection{Criterion 2}
\label{sec:org1818dbf}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
2.0 & Given a User using the application\ldots{}\\
\hline
2.1 & When a user clicks on an interactive button of the application's page,\\
 & then the application will detect the user input event.\\
 & \\
2.2 & When a user clicks on a non-interactive button of the application's\\
 & page, then the application will not detect any input.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org153261c}
None for now.

\subsection{Criterion 3}
\label{sec:org4920f6c}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
3.0 & Given a User using the application\ldots{}\\
\hline
3.1 & When a user enters HUMAN as an opponent, then the application will\\
 & allow for a second human player.\\
 & \\
3.2 & When a user enters AI as an opponent, then the application will assign\\
 & an AI as a second player.\\
 & \\
3.3 & When a user chooses neither a HUMAN or AI as an opponent then the\\
 & application will not choose and will re-prompt the user to choose an\\
 & opponent type.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:orgaa3462f}
None for now.

\subsection{Criterion 4}
\label{sec:org035372e}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
4.0 & Given a User using the application\ldots{}\\
\hline
4.1 & When a user chooses player one, then the application will assign the\\
 & role of player one to the user.\\
 & \\
4.2 & When a user chooses player 2, then the application will assign the\\
 & role of player two to the user.\\
 & \\
4.3 & When a user chooses neither player one or player two then the\\
 & application will not will not assign a player and the player will\\
 & be re-prompted\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org7ed6c18}
None for now.

\subsection{Criterion 5}
\label{sec:org7ed082b}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
5.1.0 & Given a User playing a game with unassigned pieces\ldots{}\\
\hline
5.1.1 & When the user enters an unoccupied position, then a piece of the users\\
 & color will be placed in the position.\\
 & \\
5.1.2 & When the user enters an occupied position, a piece of the users color\\
 & will not be placed in the position.\\
\hline
5.2.0 & Given a User playing a game with no unassigned pieces\ldots{}\\
\hline
5.2.1 & When the user enters an unoccupied position, then a piece of the users\\
 & color will not be placed in the position.\\
 & \\
5.2.2 & When the user enters an occupied position, then a piece of the users\\
 & color will not be placed in the position.\\
\end{tabular}
\end{center}
