doc/documentation_and_writeup.org
** Criterion 6
   :PROPERTIES:
   :CUSTOM_ID: ACID6
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  6.0 | Given a user playing the game during their turn...                      |
   |------+-------------------------------------------------------------------------|
   |  6.1 | When the user moves his piece to an unoccupied position not adjacent    |
   |      | to an opponent mill, then the piece will be shifted.                    |
   |      |                                                                         |
   |  6.2 | When the user moves his piece to an occupied position not adjacent to   |
   |      | an opponent mill, then the piece will not be shifted.                   |
   |      |                                                                         |
   |  6.3 | When the user moves his piece to an unoccupied position, adjacent to    |
   |      | an opponent mill, then the  piece will not be shifted.                  |
   |      |                                                                         |
   |  6.4 | When the user moves his piece to an occupied position, adjacent to an   |
   |      | opponent mill, then the  piece will not be shifted.                     |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 7
   :PROPERTIES:
   :CUSTOM_ID: ACID7
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  7.0 | Given a User is playing their turn...                                   |
   |------+-------------------------------------------------------------------------|
   |  7.1 | When the user places a piece in a valid position adjacent to two other  |
   |      | pieces of their color, then a mill will be formed.                      |
   |      |                                                                         |
   |  7.2 | When the user places a piece in an invalid position adjacent to two     |
   |      | other pieces of their color, then a mill will not be formed.            |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 8
   :PROPERTIES:
   :CUSTOM_ID: ACID8
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  8.0 | Given a User is playing their turn...                                   |
   |------+-------------------------------------------------------------------------|
   |  8.1 | When the user moves a piece from his mill into an opponent's piece not  |
   |      | in a mill, the opponent's piece will be replaced by the user's piece.   |
   |      |                                                                         |
   |  8.2 | When the user moves a piece from his mill into an opponent's            |
   |      | piece in a mill, the opponent's piece will be not replaced by           |
   |      | the user's piece.                                                       |
   |      |                                                                         |
   |  8.3 | When the user moves a piece from his mill into a vacant                 |
   |      | space, no opponent's piece will be replaced by the user's piece.        |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 9
   :PROPERTIES:
   :CUSTOM_ID: ACID9
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  9.0 | Given a User is playing their turn...                                   |
   |------+-------------------------------------------------------------------------|
   |  9.1 | When the user loses a piece such that they only have three pieces       |
   |      | remaining on the board, then the application will allow them to "fly"   |
   |      | their pieces to any open and valid position on the board.               |
   |      |                                                                         |
   |  9.2 | When the user loses a piece such that they have more than three pieces  |
   |      | remaining on the board, then the application will not allow them to     |
   |      | "fly" their pieces to any open and valid position on the board.         |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 10
   :PROPERTIES:
   :CUSTOM_ID: ACID10
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 10.0 | Given a User is playing their turn...                                   |
   |------+-------------------------------------------------------------------------|
   | 10.1 | When the user eliminates an opponent's pieces down to two pieces,       |
   |      | then the user wins.                                                     |
   |      |                                                                         |
   | 10.2 | When the user's pieces are eliminated down to two pieces,               |
   |      | then the user loses.                                                    |

*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** Criterion 11
   :PROPERTIES:
   :CUSTOM_ID: ACID11
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 11.0 | Given a user after they have completed a game...                        |
   |------+-------------------------------------------------------------------------|
   | 11.1 | When the user chooses to play again, then the board will be reset and   |
   |      | game count incremented.                                                 |
   |      |                                                                         |
   | 11.2 | When the user chooses not to play again, then the board will not be     |
   |      | reset and game count not incremented.                                   |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    None for now.

** [TEMPLATE, Remove UNNUMBERED prop] Criterion N
   :PROPERTIES:
   :CUSTOM_ID: ACIDN
   :UNNUMBERED: t 
   :END:
   #+ATTR_LaTeX: :align |c|l|
   | ACID | Description |
   |------+-------------|
   |    1 |             |
   |------+-------------|
   |  1.0 |             |
   
*** Further Notes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
* Implementation Tasks
  :PROPERTIES:
  :CUSTOM_ID: S4
  :END:

  This section summarizes the details of implementation tasks for the project. You will find in each
  subsection a table similar to those found in [[#SID2][$\S{2}$]] and [[#SID3][$\S{3}$]].

** Summary of Production Code

   #+ATTR_LaTeX: :align |p{4.5cm}|c|p{3.5cm}|p{4.5cm}|c|
   |                            |          | Class         |        |
   | SID & Name                 | ACID     | Name(s)       | Status |
   |----------------------------+----------+---------------+--------|
   | 2 User Input and Selection | 2.1, 2.1 | [[#PID1][Window, Board]] | Done   |


   
   #+LATEX: %%\newpage
*** Class =Window=, =Board=
    :PROPERTIES:
    :CUSTOM_ID: PID1
    :END:

    #+ATTR_LaTeX: :align |l|l|
    |               | <71>                                                                    |
    | Method        | Notes                                                                   |
    |---------------+-------------------------------------------------------------------------|
    | 1. =eventPress= | These functions relate to a pseudo-epic, and thus the testing will be   |
    | 2. =at=         | generic.                                                                |
    |               |                                                                         |

    
*** [TEMPLATE] Class =FOOBAR=
    :PROPERTIES:
    :UNNUMBERED: t
    :CUSTOM_ID: PIDN
    :END:

    Class summary goes here.

    #+ATTR_LaTeX: :align |c|l|
    |        | <71>                                                                    |
    | Method | Notes                                                                   |
    |--------+-------------------------------------------------------------------------|
    | Qud    | blah blah blah                                                          |
    
** Automated Test Code

   #+ATTR_LaTeX: :align |l|l|p{2.5cm}|p{2.5cm}|p{2.5cm}|l|l|
   |            |      | Class   | Method  |             |        |           |
   | SID & Name | ACID | Name(s) | Name(s) | Description | Status | Developer |
   |------------+------+---------+---------+-------------+--------+-----------|
   |          1 |    2 | Foo     | Bar     | Fizz        | Buzz   | Quz       |
   |            |      |         |         |             |        |           |
   |            |      |         |         |             |        |           |
   |            |      |         |         |             |        |           |
   |            |      |         |         |             |        |           |
