doc/documentation_and_writeup.tex


\subsubsection*{Further Notes}
\label{sec:org1f2f570}
None for now.

\subsection{Criterion 6}
\label{sec:org95d72ba}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
6.0 & Given a user playing the game during their turn\ldots{}\\
\hline
6.1 & When the user moves his piece to an unoccupied position not adjacent\\
 & to an opponent mill, then the piece will be shifted.\\
 & \\
6.2 & When the user moves his piece to an occupied position not adjacent to\\
 & an opponent mill, then the piece will not be shifted.\\
 & \\
6.3 & When the user moves his piece to an unoccupied position, adjacent to\\
 & an opponent mill, then the  piece will not be shifted.\\
 & \\
6.4 & When the user moves his piece to an occupied position, adjacent to an\\
 & opponent mill, then the  piece will not be shifted.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org749b08b}
None for now.

\subsection{Criterion 7}
\label{sec:org6757cb1}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
7.0 & Given a User is playing their turn\ldots{}\\
\hline
7.1 & When the user places a piece in a valid position adjacent to two other\\
 & pieces of their color, then a mill will be formed.\\
 & \\
7.2 & When the user places a piece in an invalid position adjacent to two\\
 & other pieces of their color, then a mill will not be formed.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org47c5821}
None for now.

\subsection{Criterion 8}
\label{sec:org1d2cae3}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
8.0 & Given a User is playing their turn\ldots{}\\
\hline
8.1 & When the user moves a piece from his mill into an opponent's piece not\\
 & in a mill, the opponent's piece will be replaced by the user's piece.\\
 & \\
8.2 & When the user moves a piece from his mill into an opponent's\\
 & piece in a mill, the opponent's piece will be not replaced by\\
 & the user's piece.\\
 & \\
8.3 & When the user moves a piece from his mill into a vacant\\
 & space, no opponent's piece will be replaced by the user's piece.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org4356819}
None for now.

\subsection{Criterion 9}
\label{sec:org0aa663a}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
9.0 & Given a User is playing their turn\ldots{}\\
\hline
9.1 & When the user loses a piece such that they only have three pieces\\
 & remaining on the board, then the application will allow them to "fly"\\
 & their pieces to any open and valid position on the board.\\
 & \\
9.2 & When the user loses a piece such that they have more than three pieces\\
 & remaining on the board, then the application will not allow them to\\
 & "fly" their pieces to any open and valid position on the board.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:orgd10f280}
None for now.

\subsection{Criterion 10}
\label{sec:org38befea}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
10.0 & Given a User is playing their turn\ldots{}\\
\hline
10.1 & When the user eliminates an opponent's pieces down to two pieces,\\
 & then the user wins.\\
 & \\
10.2 & When the user's pieces are eliminated down to two pieces,\\
 & then the user loses.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org67205fa}
None for now.

\subsection{Criterion 11}
\label{sec:orgbbb3dbc}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
11.0 & Given a user after they have completed a game\ldots{}\\
\hline
11.1 & When the user chooses to play again, then the board will be reset and\\
 & game count incremented.\\
 & \\
11.2 & When the user chooses not to play again, then the board will not be\\
 & reset and game count not incremented.\\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:orga1fc6ec}
None for now.

\subsection*{[TEMPLATE, Remove UNNUMBERED prop] Criterion N}
\label{sec:org26ace21}
\begin{center}
\begin{tabular}{|c|l|}
ACID & Description\\
\hline
1 & \\
\hline
1.0 & \\
\end{tabular}
\end{center}

\subsubsection*{Further Notes}
\label{sec:org441cbfe}
\section{Implementation Tasks}
\label{sec:org9bc794e}
This section summarizes the details of implementation tasks for the project. You will find in each
subsection a table similar to those found in \hyperref[sec:orgc754eda]{\(\S{2}\)} and \hyperref[sec:org17bd791]{\(\S{3}\)}.

\subsection{Summary of Production Code}
\label{sec:orgdea505c}

\begin{center}
\begin{tabular}{|p{4.5cm}|c|p{3.5cm}|p{4.5cm}|c|}
 &  & Class & \\
SID \& Name & ACID & Name(s) & Status\\
\hline
2 User Input and Selection & 2.1, 2.1 & \hyperref[sec:org2bc0459]{Window, Board} & Done\\
\end{tabular}
\end{center}



%%\newpage
\subsubsection{Class \texttt{Window}, \texttt{Board}}
\label{sec:org2bc0459}
\begin{center}
\begin{tabular}{|l|l|}
Method & Notes\\
\hline
1. \texttt{eventPress} & These functions relate to a pseudo-epic, and thus the testing will be\\
2. \texttt{at} & generic.\\
 & \\
\end{tabular}
\end{center}


\subsubsection*{[TEMPLATE] Class \texttt{FOOBAR}}
\label{sec:orgcd7d943}
Class summary goes here.

\begin{center}
\begin{tabular}{|c|l|}
Method & Notes\\
\hline
Qud & blah blah blah\\
\end{tabular}
\end{center}

\subsection{Automated Test Code}
\label{sec:org8422ced}

\begin{center}
\begin{tabular}{|l|l|p{2.5cm}|p{2.5cm}|p{2.5cm}|l|l|}
 &  & Class & Method &  &  & \\
SID \& Name & ACID & Name(s) & Name(s) & Description & Status & Developer\\
\hline
1 & 2 & Foo & Bar & Fizz & Buzz & Quz\\
 &  &  &  &  &  & \\
 &  &  &  &  &  & \\
 &  &  &  &  &  & \\
 &  &  &  &  &  & \\
\end{tabular}
\end{center}
