doc/documentation_and_writeup.org
** Manual Test Code
   #+ATTR_LaTeX: :align |p{4.5cm}|c|c|c|p{3.0cm}|
   |                             |        |      |        |                 |
   | SID & Name                  | ACID   | MTID | Status | Developer(s)    |
   |-----------------------------+--------+------+--------+-----------------|
   | [[#SID2][S2]] User Input and Selection | [[#ACID2][A2.1]]   | [[#MTID1][M1]]   | DONE   | Samuel, Michael |
   | [[#SID2][S2]] User Input and Selection | [[#ACID2][A2.2]]   | [[#MTID2][M2]]   | DONE   | Samuel, Michael |
   | [[#SID5][S5]] Piece Placement          | [[#ACID5][A5.1.1]] | [[#MTID3][M3]]   | DONE   | Samuel, Michael |
   | [[#SID5][S5]] Piece Placement          | [[#ACID5][A5.1.2]] | [[#MTID4][M4]]   | DONE   | Samuel, Michael |
   | [[#SID5][S5]] Piece Placement          | [[#ACID5][A5.2.1]] | [[#MTID5][M5]]   | DONE   | Samuel, Michael |
   | [[#SID5][S5]] Piece Placement          | [[#ACID5][A5.2.2]] | [[#MTID6][M6]]   | DONE   | Samuel, Michael |
   |                             |        |      |        |                 |
   |                             |        |      |        |                 |
*** Manual Test 1
    :PROPERTIES:
    :CUSTOM_ID: MTID1
    :END:

    #+ATTR_LaTeX: :align |p{6.0cm}|p{4.0cm}|p{3.0cm}|
    | Test Input            | Test Oracle        | Notes                        |
    |-----------------------+--------------------+------------------------------|
    | document              | function onclick() | Checks if element clickable. |
    | .getElementById("A1") |                    |                              |
    | .onclick              |                    |                              |


*** Manual Test 2
    :PROPERTIES:
    :CUSTOM_ID: MTID2
    :END:

    #+ATTR_LaTeX: :align |p{6.0cm}|p{4.0cm}|p{3.0cm}|
    | Test Input                   | Test Oracle | Notes                        |
    |------------------------------+-------------+------------------------------|
    | document                     | "undefined" | Checks if element clickable. |
    | .getElementById("container") |             |                              |
    | .onclick                     |             |                              |

*** Manual Test 3
    :PROPERTIES:
    :CUSTOM_ID: MTID3
    :END:

    #+ATTR_LaTeX: :align |p{4.0cm}|p{6.0cm}|p{3.0cm}|
    | Test Input | Test Oracle                | Notes                                |
    |------------+----------------------------+--------------------------------------|
    | "A1"       | elem.style.backgroundColor | This is a GUI test.                  |
    |            | !== undefined              |                                      |
    |            |                            | GUI will show piece placed in bottom |
    |            |                            | left corner.                         |

*** Manual Test 4
    :PROPERTIES:
    :CUSTOM_ID: MTID4
    :END:

    #+ATTR_LaTeX: :align |p{2.0cm}|p{8.0cm}|p{3.0cm}|
    | Test Input | Test Oracle                                  | Notes                                |
    |------------+----------------------------------------------+--------------------------------------|
    | "A1", "A1" | "elem.style.backgroundColor === previousColor" | This is a GUI test.                  |
    |            |                                              |                                      |
    |            |                                              | GUI will show piece placed in bottom |
    |            |                                              | left corner.                         |
*** Manual Test 5
    :PROPERTIES:
    :CUSTOM_ID: MTID5
    :END:

    #+ATTR_LaTeX: :align |p{4.0cm}|p{6.0cm}|p{3.0cm}|
    | Test Input | Test Oracle             | Notes                                |
    |------------+-------------------------+--------------------------------------|
    | "D6"       | "board === previousBoard" | This is a GUI test.                  |
    |            |                         |                                      |
    |            |                         | GUI will show piece placed in bottom |
    |            |                         | left corner.                         |
*** Manual Test 6
    :PROPERTIES:
    :CUSTOM_ID: MTID6
    :END:

    #+ATTR_LaTeX: :align |p{4.0cm}|p{6.0cm}|p{3.0cm}|
    | Test Input | Test Oracle             | Notes                                |
    |------------+-------------------------+--------------------------------------|
    | "A1"       | "board === previousBoard" | This is a GUI test.                  |
    |            |                         |                                      |
    |            |                         | GUI will show piece placed in bottom |
    |            |                         | left corner.                         |
** Other Manual Test Code

   #+ATTR_LaTeX: :align |c|c|c|c|c|c|c|
   |    |            |          |       |             |        |           |
   |    |            | Expected | Class | Method Name |        |           |
   | ID | Test Input | Result   | Name  | of Test     | Status | Developer |
   |----+------------+----------+-------+-------------+--------+-----------|
   |  1 | Foo        | Bar      | Fuzz  | Quz         | Fizz   | Bazz      |
   |    |            |          |       |             |        |           |
   |    |            |          |       |             |        |           |
   |    |            |          |       |             |        |           |

* Meeting Minutes
  :PROPERTIES:
  :ALT_TITLE: Meeting Minutes
  :APPENDIX: t
  :CUSTOM_ID: S5
  :END:
** Meeting 2019.09.04
   - Duration: 1 Hour
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - going over project pdf as group
      - discussing tech stack
      - going over sprint assignments
      - going over normal assignments
    - discussing the actual structure of sprint 1
      - requirements
      - user stories
      - what submission might look like
      - discussion of who gets to do what
      - discussion of when to meet, general availability
        - Sam will be gone from 9th through 19th
        - Elias will be gone through the 12th - 14th
*** project 1 report 
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - want to get scrum documentation done
    - get general idea down by end of this friday (2019.09.06)
      - structure of the project
      - how to use the frameworks/libraries involved (personal research/reading
        per individual)
        - Neon for rust
        - node.js
        - potentially express.js
    - generating cards, user stories
** Meeting 2019.09.06
   - Duration: 1 Hour
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - discussing game rules
    - discussing/writing user stories
    - discussing tooling
    - discussing design
*** Game Rules
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - watched a video demo'ing the game
    - discussed/clarify mechanics
      - whether or not to include coin flip
      - terms of loss
      - flying mechanic
*** User stories
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - elias wrote user stories in a new org mode file called kanban.org on the
      repository
    - discussed problem of documentation given requirements from the pdf for
      sprint 1
    - discussed alternative means of documenting, carrying out execution of our
      cards for the project
*** Tooling & Design
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - did not achieve agenda, did not get to these topics because of the time
      it took to discuss our epics/user stories.
*** TODO 
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - [ ] discuss tooling
      + need to finalize what our stack will look like and frameworks to be
         used.
      + elias has experimented with Neon and reports that it works well, seems
         viable for the product.
    - [ ] discuss design
      + need to discuss how the actual product will be packaged and its
         architecture.
** Meeting 2019.09.27
   - Duration: 1 Hour, 30 minutes
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - discuss project structure
    - acceptance criteria
    - work assignment
    - remaining TODOs
