doc/documentation_and_writeup.tex
\subsection{Manual Test Code}
\label{sec:orgde2815f}
\begin{center}
\begin{tabular}{|p{4.5cm}|c|c|c|p{3.0cm}|}
 &  &  &  & \\
SID \& Name & ACID & MTID & Status & Developer(s)\\
\hline
\hyperref[sec:orgc754eda]{S2} User Input and Selection & \hyperref[sec:org1818dbf]{A2.1} & \hyperref[sec:org196baca]{M1} & DONE & Samuel, Michael\\
\hyperref[sec:orgc754eda]{S2} User Input and Selection & \hyperref[sec:org1818dbf]{A2.2} & \hyperref[sec:org9ce9e4b]{M2} & DONE & Samuel, Michael\\
\hyperref[sec:orga52ce5b]{S5} Piece Placement & \hyperref[sec:org7ed082b]{A5.1.1} & \hyperref[sec:org3e669e4]{M3} & DONE & Samuel, Michael\\
\hyperref[sec:orga52ce5b]{S5} Piece Placement & \hyperref[sec:org7ed082b]{A5.1.2} & \hyperref[sec:org76a3987]{M4} & DONE & Samuel, Michael\\
\hyperref[sec:orga52ce5b]{S5} Piece Placement & \hyperref[sec:org7ed082b]{A5.2.1} & \hyperref[sec:orgd65a4d0]{M5} & DONE & Samuel, Michael\\
\hyperref[sec:orga52ce5b]{S5} Piece Placement & \hyperref[sec:org7ed082b]{A5.2.2} & \hyperref[sec:org6b4f489]{M6} & DONE & Samuel, Michael\\
 &  &  &  & \\
 &  &  &  & \\
\end{tabular}
\end{center}
\subsubsection{Manual Test 1}
\label{sec:org196baca}
\begin{center}
\begin{tabular}{|p{6.0cm}|p{4.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
document & function onclick() & Checks if element clickable.\\
.getElementById("A1") &  & \\
.onclick &  & \\
\end{tabular}
\end{center}


\subsubsection{Manual Test 2}
\label{sec:org9ce9e4b}
\begin{center}
\begin{tabular}{|p{6.0cm}|p{4.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
document & "undefined" & Checks if element clickable.\\
.getElementById("container") &  & \\
.onclick &  & \\
\end{tabular}
\end{center}

\subsubsection{Manual Test 3}
\label{sec:org3e669e4}
\begin{center}
\begin{tabular}{|p{4.0cm}|p{6.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
"A1" & elem.style.backgroundColor & This is a GUI test.\\
 & !== undefined & \\
 &  & GUI will show piece placed in bottom\\
 &  & left corner.\\
\end{tabular}
\end{center}

\subsubsection{Manual Test 4}
\label{sec:org76a3987}
\begin{center}
\begin{tabular}{|p{2.0cm}|p{8.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
"A1", "A1" & "elem.style.backgroundColor \texttt{=} previousColor" & This is a GUI test.\\
 &  & \\
 &  & GUI will show piece placed in bottom\\
 &  & left corner.\\
\end{tabular}
\end{center}
\subsubsection{Manual Test 5}
\label{sec:orgd65a4d0}
\begin{center}
\begin{tabular}{|p{4.0cm}|p{6.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
"D6" & "board \texttt{=} previousBoard" & This is a GUI test.\\
 &  & \\
 &  & GUI will show piece placed in bottom\\
 &  & left corner.\\
\end{tabular}
\end{center}
\subsubsection{Manual Test 6}
\label{sec:org6b4f489}
\begin{center}
\begin{tabular}{|p{4.0cm}|p{6.0cm}|p{3.0cm}|}
Test Input & Test Oracle & Notes\\
\hline
"A1" & "board \texttt{=} previousBoard" & This is a GUI test.\\
 &  & \\
 &  & GUI will show piece placed in bottom\\
 &  & left corner.\\
\end{tabular}
\end{center}
\subsection{Other Manual Test Code}
\label{sec:org21eb0cb}

\begin{center}
\begin{tabular}{|c|c|c|c|c|c|c|}
 &  &  &  &  &  & \\
 &  & Expected & Class & Method Name &  & \\
ID & Test Input & Result & Name & of Test & Status & Developer\\
\hline
1 & Foo & Bar & Fuzz & Quz & Fizz & Bazz\\
 &  &  &  &  &  & \\
 &  &  &  &  &  & \\
 &  &  &  &  &  & \\
\end{tabular}
\end{center}

\section{Meeting Minutes}
\label{sec:org19b776d}
\subsection{Meeting 2019.09.04}
\label{sec:orge9aa8b2}
\begin{itemize}
\item Duration: 1 Hour
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org9655260}
\begin{itemize}
\item going over project pdf as group
\begin{itemize}
\item discussing tech stack
\item going over sprint assignments
\item going over normal assignments
\end{itemize}
\item discussing the actual structure of sprint 1
\begin{itemize}
\item requirements
\item user stories
\item what submission might look like
\item discussion of who gets to do what
\item discussion of when to meet, general availability
\begin{itemize}
\item Sam will be gone from 9th through 19th
\item Elias will be gone through the 12th - 14th
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{project 1 report}
\label{sec:orge5c0054}
\begin{itemize}
\item want to get scrum documentation done
\item get general idea down by end of this friday (2019.09.06)
\begin{itemize}
\item structure of the project
\item how to use the frameworks/libraries involved (personal research/reading
per individual)
\begin{itemize}
\item Neon for rust
\item node.js
\item potentially express.js
\end{itemize}
\end{itemize}
\item generating cards, user stories
\end{itemize}
\subsection{Meeting 2019.09.06}
\label{sec:org9018471}
\begin{itemize}
\item Duration: 1 Hour
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org63aee87}
\begin{itemize}
\item discussing game rules
\item discussing/writing user stories
\item discussing tooling
\item discussing design
\end{itemize}
\subsubsection*{Game Rules}
\label{sec:org5367dac}
\begin{itemize}
\item watched a video demo'ing the game
\item discussed/clarify mechanics
\begin{itemize}
\item whether or not to include coin flip
\item terms of loss
\item flying mechanic
\end{itemize}
\end{itemize}
\subsubsection*{User stories}
\label{sec:org724041d}
\begin{itemize}
\item elias wrote user stories in a new org mode file called kanban.org on the
repository
\item discussed problem of documentation given requirements from the pdf for
sprint 1
\item discussed alternative means of documenting, carrying out execution of our
cards for the project
\end{itemize}
\subsubsection*{Tooling \& Design}
\label{sec:org759081f}
\begin{itemize}
\item did not achieve agenda, did not get to these topics because of the time
it took to discuss our epics/user stories.
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org25e9805}
\begin{itemize}
\item[{$\square$}] discuss tooling
\begin{itemize}
\item need to finalize what our stack will look like and frameworks to be
used.
\item elias has experimented with Neon and reports that it works well, seems
viable for the product.
\end{itemize}
\item[{$\square$}] discuss design
\begin{itemize}
\item need to discuss how the actual product will be packaged and its
architecture.
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.09.27}
\label{sec:org9fc7cd5}
\begin{itemize}
\item Duration: 1 Hour, 30 minutes
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org3f5bd01}
\begin{itemize}
\item discuss project structure
\item acceptance criteria
\item work assignment
\item remaining TODOs
\end{itemize}
