doc/documentation_and_writeup.org
*** Project Structure
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - express.js has a lot of dependencies, only really need connect.js
      + might try just using connect.js, which would be a lot simpler
      + will continue with using Neon
    - board
      + gui
        - js renders the fontend
        - logic/data is all handled on back
      + data structure/representation
        + two choices:
          1. one big board object that includes methods for both resolving where players are *and*
             where things like mills are
          2. two object entities, one is purely for the GUI (tracking positions on the board), the
             other would be some kind of graph structure that allows position nodes to check peers
             for occupation and whether it is the same or opposing players
      + movement and move validity
        - need to track flying
          + proposition: flying is a universal property, merely constrained until player count is
            reduced.
            - need some kind of getter/setter between board and entity management system
          + mill detection
            - if going with entity system, would merely be a graph traversal from any given node
            - another idea: create a mill entity system that tracks active mills and checks each
              mill upon each turn(?) and modifies or destroys the mill as necessary.
              + could save a lot of checking
              + as for organization/logical membership, would keep such a mill entity system
                independent of other objects in the system for simplicity, at least for now.
          + Checking for attack
            - if a mill entity system is used, we natively have a means to detect valid attacks. so
              long as the node is not in one of the mills, do not attack *unless* all available
              nodes are in mills.
      + game driver
        - Will have some kind of Game entity/manager object that drives the game event loop.
          + will take inputs from players, run them as game moves
            + however, internal logic to the entity management system is what will ultimately validate moves
            + game manager will have no logic for why this happens, only passes back and for game
              inputs and the results of moves.
          + consequentially, need to codify where and how game validation logic happens
      + validation logic
        - as of now, think it will be handled by the main entity management system
        - will have a set of logic checking methods defined over the system that verify whether a
          given move is allowed
*** Acceptance Criteria
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - realized we need to add numbering to the board GUI (a-g, 1-7)
    - (deferred, Sam will begin working on before next meeting)
*** Work Assignment
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - elias will begin on exploratory work for the backend (board, entity management, etc)
    - sam, michael will begin exploratory work for the frontend (GUI, communicating with backend)
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - [ ] kanban board setup, finalization of workflow for documentation
      + can probably just use github for real time management, but keep organizational and notes in
         =kanban.org= file on the repo.
    - [ ] defining test cases for stories and acceptance criteria
    - [ ] refining stories
      + same case applies with above: refine stories, and put them on github's project management
         board accordingly; actual refinement can be delegated to within =kanban.org= file.
** Meeting 2019.10.02
   - Duration: 1 Hour, 40 Minutes
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - addressing tagged issues generated on GitHub
    - settling on how front-end talks to back-end
    - documentation/design stuff
*** Issues on GitHub
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
**** issue #3: determine communication channel between js and rust
     - event polling seems overkill for what we need
     - even handler on front-end which speaks to an entity ManagerGlue, which will be the JS that
       talks to rust backend
       + There will be a manager in the back-end, which will generate game state, and return that to
         the front-end
       + back-end will also have triggers (flags? Enums?) which signal to front-end when certain
         actions are no longer needed or valid, i.e. button inputs or game state continuation
     - JSON seems like a good enough medium for message passing between front and back components
***** issue #4 is largely tagged to #3, so this resolves that
      - =State=: Input Handle + BoardStruct + Trigger)
      - =BoardState=
        + this is what gets sent back to the JS
        + 1D array of the =State= struct
          - this array will be handed off as a NeonJS object, whatever it's called in neon
          - 
**** issue #6: Front-end/GUI Skeleton, Basic Design
     1. Neon builds a node module
     2. This is sent to express.js
        - accepts it as a bunch of js functions
     3. Express takes this, as a bunch of objects, and then saves as strings to JS files, in turn
        statically served to end user (i.e. browser)
        - express.js interaction is a one-off affair
     4. Stretch goal: being able to set different themes on the front-end
**** issue #8: CI/CD
     - GitHub has native CI/CD now via it's Action's service.
     - can impl for both Rust and Node.js
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - [ ] Design docs(?)
      + at least 3 needed:
        1) event diagram
        2) general UML diagram for total project
        3) class hierarchy/component diagram
** Meeting 2019.10.03
   - Discord: 1 Hour, 53 Minutes
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - how to branch
     - branching basic_gui
     - GitHub PR format
     - styling format
*** GitHub PR format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - Show Michael how to create a branch
     - name the branch and pull from remote
     - push the branch from local
     - sync branches
     - checkout a branch
*** Branching =basic_gui=
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - created a branch =basic_gui=
     - set up an issue with the branch for PR
     - push a commit from local to remote branch
*** GitHub PR format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - went through how to form a PR from different branches
     - how to further commit to the compare branch
*** Styling Format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - no bootstrap, no jquery
     - setup proper layouts for the GUI
     - discussed how we want to handle events onclick
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - push scaffolds for the website GUI
     - handle basic logic for pushing items to back-end storage
     - create mock of Rust functionality in TypeScript for further discussion
** Meeting 2019.10.05
   - Duration: 1 Hour, 16 Minutes
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - CSS Grid
     - SASS
     - TypeScript
     - build script compilation and runtime
     - proper layout for GUI
