doc/documentation_and_writeup.tex
\subsubsection*{Project Structure}
\label{sec:org32a2eae}
\begin{itemize}
\item express.js has a lot of dependencies, only really need connect.js
\begin{itemize}
\item might try just using connect.js, which would be a lot simpler
\item will continue with using Neon
\end{itemize}
\item board
\begin{itemize}
\item gui
\begin{itemize}
\item js renders the fontend
\item logic/data is all handled on back
\end{itemize}
\item data structure/representation
\begin{itemize}
\item two choices:
\begin{enumerate}
\item one big board object that includes methods for both resolving where players are \textbf{and}
where things like mills are
\item two object entities, one is purely for the GUI (tracking positions on the board), the
other would be some kind of graph structure that allows position nodes to check peers
for occupation and whether it is the same or opposing players
\end{enumerate}
\end{itemize}
\item movement and move validity
\begin{itemize}
\item need to track flying
\begin{itemize}
\item proposition: flying is a universal property, merely constrained until player count is
reduced.
\begin{itemize}
\item need some kind of getter/setter between board and entity management system
\end{itemize}
\item mill detection
\begin{itemize}
\item if going with entity system, would merely be a graph traversal from any given node
\item another idea: create a mill entity system that tracks active mills and checks each
mill upon each turn(?) and modifies or destroys the mill as necessary.
\begin{itemize}
\item could save a lot of checking
\item as for organization/logical membership, would keep such a mill entity system
independent of other objects in the system for simplicity, at least for now.
\end{itemize}
\end{itemize}
\item Checking for attack
\begin{itemize}
\item if a mill entity system is used, we natively have a means to detect valid attacks. so
long as the node is not in one of the mills, do not attack \textbf{unless} all available
nodes are in mills.
\end{itemize}
\end{itemize}
\end{itemize}
\item game driver
\begin{itemize}
\item Will have some kind of Game entity/manager object that drives the game event loop.
\begin{itemize}
\item will take inputs from players, run them as game moves
\begin{itemize}
\item however, internal logic to the entity management system is what will ultimately validate moves
\item game manager will have no logic for why this happens, only passes back and for game
inputs and the results of moves.
\end{itemize}
\item consequentially, need to codify where and how game validation logic happens
\end{itemize}
\end{itemize}
\item validation logic
\begin{itemize}
\item as of now, think it will be handled by the main entity management system
\item will have a set of logic checking methods defined over the system that verify whether a
given move is allowed
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{Acceptance Criteria}
\label{sec:orgea706fc}
\begin{itemize}
\item realized we need to add numbering to the board GUI (a-g, 1-7)
\item (deferred, Sam will begin working on before next meeting)
\end{itemize}
\subsubsection*{Work Assignment}
\label{sec:org22fdc23}
\begin{itemize}
\item elias will begin on exploratory work for the backend (board, entity management, etc)
\item sam, michael will begin exploratory work for the frontend (GUI, communicating with backend)
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org7c13310}
\begin{itemize}
\item[{$\square$}] kanban board setup, finalization of workflow for documentation
\begin{itemize}
\item can probably just use github for real time management, but keep organizational and notes in
\texttt{kanban.org} file on the repo.
\end{itemize}
\item[{$\square$}] defining test cases for stories and acceptance criteria
\item[{$\square$}] refining stories
\begin{itemize}
\item same case applies with above: refine stories, and put them on github's project management
board accordingly; actual refinement can be delegated to within \texttt{kanban.org} file.
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.10.02}
\label{sec:org2bffb1a}
\begin{itemize}
\item Duration: 1 Hour, 40 Minutes
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:orga87733d}
\begin{itemize}
\item addressing tagged issues generated on GitHub
\item settling on how front-end talks to back-end
\item documentation/design stuff
\end{itemize}
\subsubsection*{Issues on GitHub}
\label{sec:orgbcc8091}
\begin{itemize}
\item issue \#3: determine communication channel between js and rust
\label{sec:org17badb7}
\begin{itemize}
\item event polling seems overkill for what we need
\item even handler on front-end which speaks to an entity ManagerGlue, which will be the JS that
talks to rust backend
\begin{itemize}
\item There will be a manager in the back-end, which will generate game state, and return that to
the front-end
\item back-end will also have triggers (flags? Enums?) which signal to front-end when certain
actions are no longer needed or valid, i.e. button inputs or game state continuation
\end{itemize}
\item JSON seems like a good enough medium for message passing between front and back components
\end{itemize}
\begin{itemize}
\item issue \#4 is largely tagged to \#3, so this resolves that
\label{sec:org7324086}
\begin{itemize}
\item \texttt{State}: Input Handle + BoardStruct + Trigger)
\item \texttt{BoardState}
\begin{itemize}
\item this is what gets sent back to the JS
\item 1D array of the \texttt{State} struct
\begin{itemize}
\item this array will be handed off as a NeonJS object, whatever it's called in neon
\item 
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}
\item issue \#6: Front-end/GUI Skeleton, Basic Design
\label{sec:orgde37b3a}
\begin{enumerate}
\item Neon builds a node module
\item This is sent to express.js
\begin{itemize}
\item accepts it as a bunch of js functions
\end{itemize}
\item Express takes this, as a bunch of objects, and then saves as strings to JS files, in turn
statically served to end user (i.e. browser)
\begin{itemize}
\item express.js interaction is a one-off affair
\end{itemize}
\item Stretch goal: being able to set different themes on the front-end
\end{enumerate}
\item issue \#8: CI/CD
\label{sec:orgb99792d}
\begin{itemize}
\item GitHub has native CI/CD now via it's Action's service.
\item can impl for both Rust and Node.js
\end{itemize}
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org39f5333}
\begin{itemize}
\item[{$\square$}] Design docs(?)
\begin{itemize}
\item at least 3 needed:
\begin{enumerate}
\item event diagram
\item general UML diagram for total project
\item class hierarchy/component diagram
\end{enumerate}
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.10.03}
\label{sec:org6c15f45}
\begin{itemize}
\item Discord: 1 Hour, 53 Minutes
\item Location: Video Call
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org7540f12}
\begin{itemize}
\item how to branch
\item branching basic\(_{\text{gui}}\)
\item GitHub PR format
\item styling format
\end{itemize}
\subsubsection*{GitHub PR format}
\label{sec:org463bab8}
\begin{itemize}
\item Show Michael how to create a branch
\item name the branch and pull from remote
\item push the branch from local
\item sync branches
\item checkout a branch
\end{itemize}
\subsubsection*{Branching \texttt{basic\_gui}}
\label{sec:org701ca59}
\begin{itemize}
\item created a branch \texttt{basic\_gui}
\item set up an issue with the branch for PR
\item push a commit from local to remote branch
\end{itemize}
\subsubsection*{GitHub PR format}
\label{sec:orgd02ddcd}
\begin{itemize}
\item went through how to form a PR from different branches
\item how to further commit to the compare branch
\end{itemize}
\subsubsection*{Styling Format}
\label{sec:orgd0251ed}
\begin{itemize}
\item no bootstrap, no jquery
\item setup proper layouts for the GUI
\item discussed how we want to handle events onclick
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org162cbc9}
\begin{itemize}
\item push scaffolds for the website GUI
\item handle basic logic for pushing items to back-end storage
\item create mock of Rust functionality in TypeScript for further discussion
\end{itemize}
\subsection{Meeting 2019.10.05}
\label{sec:orgf9b77ad}
\begin{itemize}
\item Duration: 1 Hour, 16 Minutes
\item Location: Video Call
\end{itemize}
