doc/documentation_and_writeup.org
*** CSS Grid
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - teach Michael about CSS Grid
     - pure CSS, not bootstrap (Elias)
     - use columns properly
     - no need for floats / flexbox
*** SASS
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - transpiler for CSS
     - allows nested functionality
     - separate compiled/uncompiled folders
     - use =watch= script to sync changes
*** TypeScript
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - better able to handle equivalence mocking to Rust
     - easy to push onto browser
     - separate folders (see above)
     - push to public folder for site access
*** Build Script Compilation and Runtime
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - use watch and start scripts to build site
     - separate scripts will be run for Rust beforehand
     - build scripts allow for synced changes between folders (see above)
*** Proper Layout for GUI
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - use column areas in CSS Grid
     - main column for game
     - nested grid for board layout (tentative)
     - proportion text for board side-by-side
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - design docs
     - microcharter
     - mocking TS => Rust
     - event keys on front-end (browser)
** Meeting 2019.10.06
   - Duration: 7 hours
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Tying up loose ends with respect to documentation and write up
    - Tying up loose ends with respect to UI/JS end of the application
    - Discussing what is left to do with the project
*** Documentation and Write-up
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Figured out how to format the tables given that many of the ones provided do not play well
      with latex/org-mode markdown
    - Similarly, decided on how to interconnect documentation components between sections
    - Discussed the remaining things left undocumented, particularly pair ratings.
*** UI/JS Loose Ends
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Complete manual testing of interacting elements
    - Finalize positions of clickable elements on the board grid.
    - Alternating player logic for placement of pieces.
    - Limiting piece placement to nine.
*** Discussing Future Sprint/Direction of Project
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Current User Stories are pseudo-Epics and need to be refined into better User stories aside
      from [[#SID1][S1]]. As they stand, discussing the current user stories makes for overly generic/abstract
      discussion and doesn't meaningfully translate into logic/behavior to implement and actual
      engineering tasks.
    - Currently, the front end mocks all of the behavior/functionality that would otherwise be
      provided by the backend. In sprint 2, this is where the real meat of programming will come in
      as we learn to make the back-end and front-end interface, particularly with translating data
      types across the FFI boundary through Neon.
    - We need to improve the current state documentation massively.
      + Design diagrams.
      + Docstrings across software code base.
      + Event diagrams.
    - Translate the above issues into their proper documentation for the master documentation and
      write-up file
    - How to test more of the functionality given that a major component of this application is
      running directly on the browser.
* Team Ratings

  Submission document does not specify scale, so it is assumed out of 5 with 1 being "Worst" and 5
  being "Excellent".

  #+ATTR_LaTeX: :align |c|c|c|c|
  |---------------------------+---------------------------+---------------+---------------------|
  |                           | Elias Julian Marko Garcia | Michael Sy Cu | Samuel Chia Ern Lim |
  |---------------------------+---------------------------+---------------+---------------------|
  | Elias Julian Marko Garcia |                         - |             5 |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|
  | Michael Sy Cu             |                         5 |             - |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|
  | Samuel Chia Ern           |                         5 |             5 |                   - |
  |---------------------------+---------------------------+---------------+---------------------|
  | Average                   |                         5 |             5 |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|


