doc/documentation_and_writeup.tex
\subsubsection*{Agenda}
\label{sec:orgb3c67c4}
\begin{itemize}
\item CSS Grid
\item SASS
\item TypeScript
\item build script compilation and runtime
\item proper layout for GUI
\end{itemize}
\subsubsection*{CSS Grid}
\label{sec:org8993010}
\begin{itemize}
\item teach Michael about CSS Grid
\item pure CSS, not bootstrap (Elias)
\item use columns properly
\item no need for floats / flexbox
\end{itemize}
\subsubsection*{SASS}
\label{sec:org8aedfea}
\begin{itemize}
\item transpiler for CSS
\item allows nested functionality
\item separate compiled/uncompiled folders
\item use \texttt{watch} script to sync changes
\end{itemize}
\subsubsection*{TypeScript}
\label{sec:orgd0fc417}
\begin{itemize}
\item better able to handle equivalence mocking to Rust
\item easy to push onto browser
\item separate folders (see above)
\item push to public folder for site access
\end{itemize}
\subsubsection*{Build Script Compilation and Runtime}
\label{sec:org05bb84a}
\begin{itemize}
\item use watch and start scripts to build site
\item separate scripts will be run for Rust beforehand
\item build scripts allow for synced changes between folders (see above)
\end{itemize}
\subsubsection*{Proper Layout for GUI}
\label{sec:orgc11a9a2}
\begin{itemize}
\item use column areas in CSS Grid
\item main column for game
\item nested grid for board layout (tentative)
\item proportion text for board side-by-side
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:orgbb412c3}
\begin{itemize}
\item design docs
\item microcharter
\item mocking TS => Rust
\item event keys on front-end (browser)
\end{itemize}
\subsection{Meeting 2019.10.06}
\label{sec:orgba53a68}
\begin{itemize}
\item Duration: 7 hours
\item Location: Video Call
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org74afb0f}
\begin{itemize}
\item Tying up loose ends with respect to documentation and write up
\item Tying up loose ends with respect to UI/JS end of the application
\item Discussing what is left to do with the project
\end{itemize}
\subsubsection*{Documentation and Write-up}
\label{sec:orgf1f6563}
\begin{itemize}
\item Figured out how to format the tables given that many of the ones provided do not play well
with latex/org-mode markdown
\item Similarly, decided on how to interconnect documentation components between sections
\item Discussed the remaining things left undocumented, particularly pair ratings.
\end{itemize}
\subsubsection*{UI/JS Loose Ends}
\label{sec:orgcf0cc4a}
\begin{itemize}
\item Complete manual testing of interacting elements
\item Finalize positions of clickable elements on the board grid.
\item Alternating player logic for placement of pieces.
\item Limiting piece placement to nine.
\end{itemize}
\subsubsection*{Discussing Future Sprint/Direction of Project}
\label{sec:org5325878}
\begin{itemize}
\item Current User Stories are pseudo-Epics and need to be refined into better User stories aside
from \hyperref[sec:org9d3ac7c]{S1}. As they stand, discussing the current user stories makes for overly generic/abstract
discussion and doesn't meaningfully translate into logic/behavior to implement and actual
engineering tasks.
\item Currently, the front end mocks all of the behavior/functionality that would otherwise be
provided by the backend. In sprint 2, this is where the real meat of programming will come in
as we learn to make the back-end and front-end interface, particularly with translating data
types across the FFI boundary through Neon.
\item We need to improve the current state documentation massively.
\begin{itemize}
\item Design diagrams.
\item Docstrings across software code base.
\item Event diagrams.
\end{itemize}
\item Translate the above issues into their proper documentation for the master documentation and
write-up file
\item How to test more of the functionality given that a major component of this application is
running directly on the browser.
\end{itemize}
\section{Team Ratings}
\label{sec:orgb7b2ab3}

Submission document does not specify scale, so it is assumed out of 5 with 1 being "Worst" and 5
being "Excellent".

\begin{center}
\begin{tabular}{|c|c|c|c|}
\hline
 & Elias Julian Marko Garcia & Michael Sy Cu & Samuel Chia Ern Lim\\
\hline
Elias Julian Marko Garcia & - & 5 & 5\\
\hline
Michael Sy Cu & 5 & - & 5\\
\hline
Samuel Chia Ern & 5 & 5 & -\\
\hline
Average & 5 & 5 & 5\\
\hline
\end{tabular}
\end{center}
\end{document}